Repository: common-repository/recall-products
Catalog: languages/recall-*.po
Languages: nl_nl

source: Not all fields are filled!
nl_nl: Niet alle velden zijn ingevuld!

source: Manufacturer added
nl_nl: Fabrikant toegevoegd

source: Manufacturer already exists
nl_nl: Fabrikant bestaat al

source: Recall Settings
nl_nl: Recall Instellingen

source: Enter Manufacturer here
nl_nl: Fabrikant hier invoeren

source: Add
nl_nl: Toevoegen

source: No data available
nl_nl: Geen gegevens beschikbaar

source: Manufacturer
nl_nl: Fabrikant

source: Author
nl_nl: Auteur

source: Delete
nl_nl: Verwijderen

source: Manufacturer deleted
nl_nl: Fabrikant verwijderd

source: Manufacturer has models. First remove the models for which the manufacturer can be removed.
nl_nl: Fabrikant beschikt over modellen. Verwijder eerst de modellen voor dat de fabrikant verwijderd kan worden.

source: Add New
nl_nl: Nieuwe fabrikant

source: Subscription
nl_nl: Abonnement

source: Model deleted
nl_nl: Model verwijderd

source: Customers have this model. Remove the customers who have this model. Only then the model can be removed.
nl_nl: Klanten hebben dit model. Verwijder eerst de klanten die dit model hebben. Dan pas kan het model verwijderd worden.

source: Terms and Conditions URL
nl_nl: Algemene voorwaarden URL

source: Export all subscribers
nl_nl: Exporteer alle abonnees

source: Add Manufacturer
nl_nl: Nieuwe fabrikant

source: Manufacturer is not filled!
nl_nl: Fabrikant is niet ingevuld!

source: Model is not filled!
nl_nl: Model is niet ingevuld!

source: Firstname is not filled!
nl_nl: Voornaam is niet ingevuld

source: Lastname is not filled!
nl_nl: Achternaam is niet ingevuld!

source: E-mail is not filled!
nl_nl: E-mail is niet ingevuld

source: You are registered
nl_nl: U bent geregistreerd

source: Terms and Conditions not accepted
nl_nl: Algemene voorwaarden niet geaccepteerd

source: Select a manufacturer
nl_nl: Selecteer een fabrikant

source: Firstname
nl_nl: Voornaam

source: Lastname
nl_nl: Achternaam

source: required
nl_nl: Verplicht

source: Terms and Conditions
nl_nl: Algemene voorwaarden

source: Register
nl_nl: Registreren

source: Widget Title:
nl_nl: Widget Titel:
